--     1 2 3 4 5 6 7
--7 = (1,1,1,1,1,1,1)
--7 = (2,1,1,1,1,1,0)
--7 = (2,2,1,1,1,0,0)
--7 = (3,1,1,1,1,0,0)
--7 = (3,2,1,1,0,0,0)
--7 = (3,3,1,0,0,0,0)
--7 = (4,1,1,1,0,0,0)
--7 = (4,2,1,0,0,0,0)
--7 = (4,3,0,0,0,0,0)
--7 = (5,1,1,0,0,0,0)
--7 = (5,2,0,0,0,0,0)
--7 = (6,1,0,0,0,0,0)
--7 = (7,0,0,0,0,0,0)

-- Алгоритм принимает n: Для чисел k из 1..n ставим первым числом k и запускаем рекурсивно алгоритм от n-k.

getVector :: Int -> [[Int]]
getVector 0 = [[]]
getVector n = do
	x <- [1..n]
	xs <- getVector(n-x)
	[x:xs]
	
